.emacs.d/config.org
#+TITLE: My Org config
#+DATE: 2023-11-19 Sun
#+AUTHOR: Lucas Elvira Martín
* Table Of Content                                                      :TOC:
- [[#put-this-in-your-initel][PUT THIS IN YOUR init.el]]
- [[#package-system-setup][Package system setup]]
  - [[#enable-straight][Enable straight]]
  - [[#startup-performance][Startup performance]]
- [[#keep-it-clean][Keep it clean]]
- [[#custom-library][Custom library]]
- [[#set-encoding-by-default][Set encoding by default]]
- [[#disable-warnings][Disable warnings]]
- [[#autorun][AUTORUN]]
  - [[#emacs-as-server][Emacs as server]]
- [[#keyboard-binding][Keyboard binding]]
  - [[#esc-as-c-g][ESC as C-g]]
  - [[#rebind-c-u][Rebind C-u]]
  - [[#set-up-evil-mode][Set up evil mode]]
  - [[#which-key][Which Key]]
  - [[#generalel][General.el]]
- [[#ui][UI]]
  - [[#reduce-distraction][Reduce distraction]]
  - [[#maximize-window-by-default][Maximize window by default]]
  - [[#transparency][Transparency]]
  - [[#enable-line-numbers][Enable line numbers]]
  - [[#ignore-warning-messages-when-following-symlinks][Ignore warning messages when following symlinks]]
  - [[#collor-theme][Collor Theme]]
  - [[#fonts][Fonts]]
  - [[#better-modeline][Better Modeline]]
  - [[#auto-revert-buffer][Auto revert buffer]]
  - [[#toggle-display-white-space][Toggle display white space]]
  - [[#highlight-matching-parentheses][Highlight matching parentheses]]
- [[#editing-configuration][Editing configuration]]
  - [[#tramp][Tramp]]
  - [[#tab-widths][Tab widths]]
  - [[#commenting-lines][Commenting lines]]
- [[#configuration-files][Configuration files]]
- [[#customize-shortcuts][Customize shortcuts]]
  - [[#bookmarks-and-buffer][Bookmarks and buffer]]
- [[#completion-system][Completion system]]
  - [[#ivy-and-counsel][ivy and counsel]]
  - [[#helpul][helpul]]
- [[#file-browsing-with-dired][File Browsing with dired]]
  - [[#keybinding-within-dired][Keybinding within dired]]
  - [[#keybinding-for-peep-dired-mode][Keybinding for peep-dired-mode]]
  - [[#open-files-externally][Open files externally]]
  - [[#files][Files]]
- [[#writting][Writting]]
  - [[#tools][Tools]]
  - [[#text-mode][Text mode]]
  - [[#org-mode][Org mode]]
  - [[#org-roam-mode][Org roam mode]]
  - [[#pdfs][PDFs]]
- [[#dashboard][Dashboard]]
- [[#terminal-emulator][Terminal emulator]]
  - [[#vterm][vterm]]
- [[#development][Development]]
  - [[#projectile][Projectile]]
  - [[#magit][Magit]]
  - [[#github-copilot][Github copilot]]
  - [[#languages][Languages]]
- [[#applications][Applications]]
  - [[#calendar][Calendar]]

* PUT THIS IN YOUR init.el

#+begin_example
(org-babel-load-file
(expand-file-name
"config.org"
  user-emacs-directory))
#+end_example
Also, turn on lexical-binding for the init file!

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
;(server-start)
#+end_src

* Package system setup

Emacs has a built in package manager but it doesn’t make it easy to automatically install packages
on a new system the first time you pull down your configuration. [[https:github.com/jwiegley/use-package][use-package]] is a really helpful
package used in this configuration to make it a lot easier to automate the installation and
configuration of everything else we use.

#+begin_src emacs-lisp

(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("melpa-stable" . "https://stable.melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)

(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

** Enable straight

#+begin_src emacs-lisp
;; Bootstrap straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
      (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
        "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
        'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Always use straight to install on systems other than Linux
(setq straight-use-package-by-default (not (eq system-type 'gnu/linux)))

;; Use straight.el for use-package expressions
(straight-use-package 'use-package)

;; Clean up unused repos with `straight-remove-unused-repos'
#+end_src

** Startup performance

Make startup faster by reducing the frequency of garbage collection and then use
a hook to measure Emacs startup time.

#+begin_src emacs-lisp
(use-package gcmh
:config
(gcmh-mode 1))
;; Setting garbage collection threshold
(setq gc-cons-threshold (* 50 1000 1000)
    gc-cons-percentage 0.6)
;; Profile emacs startup
(add-hook 'emacs-startup-hook
        (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                    (format "%.2f seconds"
                            (float-time
                            (time-subtract after-init-time before-init-time)))
                    gcs-done)))

#+end_src

* Keep it clean
First I define the default emacs back-up where all the cache files will be
stored

#+begin_src emacs-lisp
;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
(setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
      url-history-file (expand-file-name "url/history" user-emacs-directory))
;;
;; Use no-littering to automatically set common paths to the new user-emacs-directory

(use-package no-littering)
#+end_src

Then define where will be store the temporal files

#+begin_src emacs-lisp
(setq backup-directory-alist '(("." . "~/.cache/emacs/backup/"))
  backup-by-copying t    ; Don't delink hardlinks
  version-control t      ; Use version numbers on backups
  delete-old-versions t  ; Automatically delete excess backups
  kept-new-versions 20   ; how many of the newest versions to keep
  kept-old-versions 5    ; and how many of the old
  )
#+end_src

* Custom library

I would like to make this configuration as modular as possible, so I will break it up into multiples
files. With that in mind, I add a directory to the path.

#+begin_src emacs-lisp
(push "~/Documents/git/dotfiles/emacs.d/lisp" load-path)
#+end_src

* Set encoding by default
#+begin_src emacs-lisp
(set-default-coding-systems 'utf-8)
#+end_src

* Disable warnings
The first time emacs is open, display a lot of annoying warnings. To prevent
this, use ~native-comp-async-report-warnings-errors~
#+begin_src emacs-lisp
(setq native-comp-async-report-warnings-errors nil)
#+end_src

* AUTORUN
** Emacs as server

This command allow to run emacs as server, so all the startup can be done once
time and connect client to it each time you need.

#+begin_src emacs-lisp
  (server-start)
#+end_src

*** Connect a client
To connect a client to the server you need to run

#+begin_example shell
emacsclient --create-frame --alternate-editor=""
 or use an alias
export ALTERNATE_EDITOR=""
export EDITOR="emacsclient -t"                  # $EDITOR opens in terminal
export VISUAL="emacsclient -c -a emacs"         # $VISUAL opens in GUI mode
#+end_example
* Keyboard binding

** ESC as C-g

#+begin_src emacs-lisp
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** Rebind C-u

#+begin_src emacs-lisp
(global-set-key (kbd "C-M-u") 'universal-argument)
#+end_src

** Set up evil mode
Evil mode is a mayor mode that allow to use vim keybindings in emacs

#+begin_src emacs-lisp
  ;; Define a hook to prevent evil mode be load in some modes
  (defun lem/evil-custom-state ()
    (dolist (mode '(custom-mode
                    eshell-mode
                    git-rebase-mode
                    erc-mode
                    circe-server-mode
                    circe-chat-mode
                    circe-query-mode
                    sauron-mode
                    term-mode))
    (add-to-list 'evil-emacs-state-modes mode)))

  (defun rune/dont-arrow-me-bro ()
    (interactive)
    (message "Arrow keys are bad, you know?"))

  (use-package undo-tree
    :init
    (global-undo-tree-mode 1)
  :config
  (setq undo-tree-auto-save-history nil))
#+end_src
*** Install evil mode

This configuration uses [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] for a Vi-like modal editing experience.
[[https://github.com/noctuid/general.el][general.el]] is used for easy keybinding configuration that integrates well with
which-key.  [[https://github.com/emacs-evil/evil-collection][evil-collection]] is used to automatically configure various Emacs
modes with Vi-like keybindings for evil-mode.
#+begin_src emacs-lisp

  (use-package evil
   :init
   (setq evil-want-integration t
        evil-want-keybinding nil
        evil-want-C-u-scroll t
        evil-want-C-i-jump t
        evil-undo-system 'undo-tree
        evil-respect-visual-line-mode t)
   :config
   (add-hook 'evil-mode-hook 'lem/evil-custom-state)
   (evil-mode 1)
   (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
   (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
   (evil-set-initial-state 'messages-buffer-mode 'normal)
   (evil-set-initial-state 'dashboard-mode 'normal)
  ; (evil-set-initial-state 'term-mode 'emacs)

    ;;; Disable arrow keys in insert mode
    (define-key evil-insert-state-map (kbd "<left>") 'rune/dont-arrow-me-bro)
    (define-key evil-insert-state-map (kbd "<right>") 'rune/dont-arrow-me-bro)
    (define-key evil-insert-state-map (kbd "<down>") 'rune/dont-arrow-me-bro)
    (define-key evil-insert-state-map (kbd "<up>") 'rune/dont-arrow-me-bro))
#+end_src

*** Install evil-collection
Evil collection is a package that provide evil keybindings for a lot of modes

#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil
    :custom
    (evil-collection-outline-bind-tab-p nil)
    :config
    (evil-collection-init))


  (use-package evil-numbers
    :after evil
    :hook 'lem/evil-mode-number-hook)

  (define-key evil-normal-state-map (kbd "C-a +") 'evil-numbers/inc-at-pt)
  (define-key evil-normal-state-map (kbd "C-a -") 'evil-numbers/dec-at-pt)
  (define-key evil-normal-state-map (kbd "C-a g +") 'evil-numbers/inc-at-pt-incremental)
  (define-key  evil-normal-state-map (kbd "C-a g -") 'evil-numbers/dec-at-pt-incremental)

  (use-package evil-surround
    :ensure t
    :config
    (global-evil-surround-mode 1))

#+end_src


