.emacs.d/config.org
** Which Key

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to
offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control
and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the
bindings under that prefix and which command they run.  This is very useful for learning the
possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))
#+end_src

** General.el

#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup t)

  (general-create-definer lem/leader-key-def
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC"))
#+end_src

* UI

This section configures basic UI settings that remove unneded elements to make Emacs look a lot more minimal and modern.
** Reduce distraction

#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 0)        ; Give some breathing room (menu-bar-mode -1)            ; Disable the menu bar
  (menu-bar-mode -1)
  ;; Set up the visible bell
  (setq visible-bell t)
  (electric-indent-mode -1)
  (electric-pair-mode -1)

#+end_src

** Maximize window by default
#+begin_src emacs-lisp
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

** Transparency

#+begin_src emacs-lisp
(unless (string= (getenv "DESKTOP_SESSION") "gnome")
    (set-frame-parameter nil 'alpha '(90 . 90))
    (add-to-list 'default-frame-alist '(alpha-background . 90)))
#+end_src

** Enable line numbers
#+begin_src emacs-lisp
(column-number-mode)

;; Enable line numbers for some modes
(dolist (mode '(text-mode-hook
                prog-mode-hook
                conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))
#+end_src
** Ignore warning messages when following symlinks

#+begin_src emacs-lisp
(setq vc-follow-symlinks t)
#+end_src

** Collor Theme

[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] is a great set of themes with a lot of variety and support for many different Emacs
modes.  Taking a look at the [[https://github.com/hlissner/emacs-doom-themes/tree/screenshots][screenshots]] might help you decide which one you like best.  You can
also run =M-x counsel-load-theme= to choose between them easily.

#+begin_src emacs-lisp
(use-package spacegray-theme :defer t)
(use-package doom-themes :defer t)
(load-theme 'doom-dracula t)
(doom-themes-visual-bell-config)
#+end_src

** Fonts

#+begin_src emacs-lisp
      ;; Set the font
    (setq default-mono-font "Fira Code"
          default-variable-pitch-font "Noto Sans Mono")
    (set-face-attribute 'default nil
        :font default-mono-font
        :height 110)
    (set-face-attribute 'fixed-pitch nil
      :family default-mono-font :height 1.0 :inherit 'default)
    (set-face-attribute 'variable-pitch nil
      :family default-variable-pitch-font :weight 'regular :inherit 'default)
#+end_src

*** Ligatures
#+begin_src emacs-lisp
  (use-package ligature
  :config
  (ligature-set-ligatures 't '("www"))
  ;; Enable traditional ligature support in eww-mode, if the
  ;; `variable-pitch' face supports it
  (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
  ;; Enable all Cascadia Code ligatures in programming modes
  (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                       ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                       "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                       "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                       "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                       "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                       "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                       "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                       ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                       "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                       "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                       "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                       "\\\\" "://"))
  ;; Enables ligature checks globally in all buffers. You can also do it
  ;; per mode with `ligature-mode'.
  (global-ligature-mode t))
#+end_src


** Better Modeline

[[https://github.com/seagle0128/doom-modeline][doom-modeline]] is a very attractive and rich (yet still minimal) mode line
configuration for Emacs.  The default configuration is quite good but you can
check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

*NOTE:* The first time you load your configuration on a new machine, you'll need
to run `M-x all-the-icons-install-fonts` so that mode line icons display
correctly.

#+begin_src emacs-lisp
  (setq display-time-format "%H:%M %b %y"
        display-time-default-load-average nil)
  (display-time-mode 1)
  ;; Dimish modeline clutter hides pesky minor modes
  (use-package diminish)

  ;; All the icons
  (use-package all-the-icons)
  (use-package minions
    :hook (doom-modeline-mode . minions-mode))

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom
    (doom-modeline-height 15)
    (doom-modeline-bar-width 0)
    (doom-modeline-minor-modes t)
    (doom-modeline-persp-name nil)
    (doom-modeline-buffer-file-name-style 'truncate-except-project)
    (doom-modeline-major-mode-icon nil))
#+end_src

** Auto revert buffer

#+begin_src emacs-lisp
;; Revert Dired and other buffers
(setq global-auto-revert-non-file-buffers t)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)
#+end_src

** Toggle display white space

#+begin_src emacs-lisp
(lem/leader-key-def
  "t"  '(:ignore t :which-key "toggles")
  "tw" '(whitespace-mode :which-key "whitespace"))
#+end_src

** Highlight matching parentheses

#+begin_src emacs-lisp
(use-package paren
  :config
  (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
  (show-paren-mode 1))
#+end_src

* Editing configuration
** Tramp
Tramp is a built-in package that allows you to open files over SSH, su, and sudo
from within Emacs. It’s incredibly useful if you need to edit files as root or
on a remote machine frequently.

#+begin_src emacs-lisp
(use-package tramp
  :defer t
  :config
  (setq tramp-default-method "ssh"))
#+end_src

** Tab widths
Default tab width is 8, which is too much. We can change it to 4.

#+begin_src emacs-lisp
(setq-default tab-width 2)
(setq-default evil-shift-width tab-width)
;; use spaces instead of tabs
(setq-default indent-tabs-mode nil)
#+end_src

** Commenting lines

#+begin_src emacs-lisp
(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src

* Configuration files
We can set a sortcut to open the config file from the emacs directory

#+begin_src emacs-lisp
  (lem/leader-key-def
  "fd" '((lambda () (interactive) (counsel-find-file "~/Documents/git/dotfiles")) :which-key "Config")
  "fo" '((lambda () (interactive) (counsel-find-file "~/Documents/Org/")) :which-key "Org files")
  "fe" '(:ignore t :which-key "Emacs Config")
  "fec" '((lambda () (interactive) (find-file "~/Documents/git/dotfiles/.emacs.d/config.org")) :which-key "Emacs Config file")
  "few" '((lambda () (interactive) (find-file "~/Documents/git/dotfiles/.emacs.d/org-workflow.org")) :which-key "Emacs workflow file")
  "fez" '((lambda () (interactive) (find-file "~/Documents/git/dotfiles/.emacs.d/org-zettelkasten.org")) :which-key "Emacs zettel file"))
#+end_src

* Customize shortcuts

** Bookmarks and buffer

Use 'SPC b' for keybinings related to bookmarks and buffers

*** Bookmarks
Bookmarks are somewhat like registers in that they record positions you can jump to.  Unlike registers, they have long names, and they persist automatically from one Emacs session to the next. The prototypical use of bookmarks is to record where you were reading in various files.

| COMMAND         | DESCRIPTION                              | KEYBINDING |
|-----------------+------------------------------------------+------------|
| list-bookmarks  | /List bookmarks/                         | SPC b L    |
| bookmark-set    | /Set bookmark/                           | SPC b m    |
| bookmark-delete | /Delete bookmark/                        | SPC b M    |
| bookmark-save   | /Save current bookmark to bookmark file/ | SPC b w    |

#+begin_src emacs-lisp
  (setq bookmark-default-file (expand-file-name "bookmarks" user-emacs-directory))
  (lem/leader-key-def
  "b" '(:ignore t :which-key "buffers/bookmarks")
  "bL" '(list-bookmarks :which-key "List bookmarks")
  "bm" '(bookmark-set :which-key "Set bookmark")
  "bd" '(bookmark-delete :which-key "Delete bookmark")
  "bw" '(bookmark-save :which-key "Save current bookmark to bookmark file"))

#+end_src

*** Buffers
Regarding /buffers/, the text you are editing in Emacs resides in an object
called a /buffer/. Each time you visit a file, a buffer is used to hold the
file’s text. Each time you invoke Dired, a buffer is used to hold the directory
listing.  /Ibuffer/ is a program that lists all of your Emacs /buffers/,
allowing you to navigate between them and filter them.

| COMMAND               | DESCRIPTION            | KEYBINDING |
|-----------------------+------------------------+------------|
| counsel-switch-buffer | /change Buffer/        | SPC b i    |
| kill-buffer           | /Kill current buffer/  | SPC b k    |
| next-buffer           | /Goto next buffer/     | SPC b n    |
| previous-buffer       | /Goto previous buffer/ | SPC b p    |
| save-buffer           | /Save current buffer/  | SPC b s    |


#+begin_src emacs-lisp
    (lem/leader-key-def
  "bi" '(counsel-switch-buffer :which-key "Counsel switch buffer")
  "bk" '(kill-current-buffer :whick-key "Kill current buffer")
  "bn" '(next-buffer :whick-key "Goto next buffer")
  "bp" '(previous-buffer :whick-key "Goto previous-buffer buffer")
  "bs" '(save-buffer :whick-key "Save current buffer"))
#+end_src

* Completion system

