.emacs.d/config.el

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

(use-package general
  :config
  (general-evil-setup t)

  (general-create-definer lem/leader-key-def
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC"))

(setq inhibit-startup-message t)

  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room

  (menu-bar-mode -1)            ; Disable the menu bar

  ;; Set up the visible bell
  (setq visible-bell t)

(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))

;; (set-frame-parameter (selected-frame) 'alpha '(90 90))
(add-to-list 'default-frame-alist '(alpha-background . 90))

(column-number-mode)

;; Enable line numbers for some modes
(dolist (mode '(text-mode-hook
                prog-mode-hook
                conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))

(setq vc-follow-symlinks t)

(use-package spacegray-theme :defer t)
(use-package doom-themes :defer t)
(load-theme 'doom-dracula t)
(doom-themes-visual-bell-config)

;; Set the font
(setq default-mono-font "Fira Code"
          default-variable-pitch-font "Noto Sans")
  (set-face-attribute 'default nil :font default-mono-font :height 120)
  (set-face-attribute 'fixed-pitch nil :family default-mono-font :height 1.0 :inherit 'default)
  (set-face-attribute 'variable-pitch nil :family default-variable-pitch-font :weight 'regular :inherit 'default)

(setq display-time-format "%H:%M %b %y"
    display-time-default-load-average nil)
(display-time-mode 1)
  ;; Dimish modeline clutter hides pesky minor modes
  (use-package diminish)

  ;; All the icons
  (use-package all-the-icons)
  (use-package minions
    :hook (doom-modeline-mode . minions-mode))

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom
    (doom-modeline-height 15))

;; Revert Dired and other buffers
(setq global-auto-revert-non-file-buffers t)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)

(lem/leader-key-def
  "t"  '(:ignore t :which-key "toggles")
  "tw" '(whitespace-mode :which-key "whitespace"))

(use-package paren
  :config
  (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
  (show-paren-mode 1))

(use-package tramp
  :defer t
  :config
  (setq tramp-default-method "ssh"))

(setq-default tab-width 4)
(setq-default evil-shift-width tab-width)
;; use spaces instead of tabs
(setq-default indent-tabs-mode nil)

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(lem/leader-key-def
"fd" '((lambda () (interactive) (counsel-find-file "~/Documents/git/dotfiles")) :which-key "Config")
"fo" '((lambda () (interactive) (counsel-find-file "~/Documents/Org/")) :which-key "Org files")
"fe" '(:ignore t :which-key "Emacs Config")
"fec" '((lambda () (interactive) (find-file "~/Documents/git/dotfiles/.emacs.d/config.org")) :which-key "Emacs Config file")
"few" '((lambda () (interactive) (find-file "~/Documents/git/dotfiles/.emacs.d/org-workflow.org")) :which-key "Emacs workflow file")
"fez" '((lambda () (interactive) (find-file "~/Documents/git/dotfiles/.emacs.d/org-zettelkasten.org")) :which-key "Emacs zettel file"))

(setq bookmark-default-file (expand-file-name "bookmarks" user-emacs-directory))
(lem/leader-key-def
"b" '(:ignore t :which-key "buffers/bookmarks")
"bL" '(list-bookmarks :which-key "List bookmarks")
"bm" '(bookmark-set :which-key "Set bookmark")
"bd" '(bookmark-delete :which-key "Delete bookmark")
"bw" '(bookmark-save :which-key "Save current bookmark to bookmark file"))

(lem/leader-key-def
"bi" '(counsel-switch-buffer :which-key "Counsel switch buffer")
"bk" '(kill-current-buffer :whick-key "Kill current buffer")
"bn" '(next-buffer :whick-key "Goto next buffer")
"bp" '(previous-buffer :whick-key "Goto previous-buffer buffer")
"bs" '(save-buffer :whick-key "Save current buffer"))
