.emacs.d/config.org
**** Toggle dictionaries

#+begin_src emacs-lisp
  (defun lem/switch-dictionary()
  (interactive)
  (let* ((dic ispell-current-dictionary)
     (change (if (string= dic "en_US") "es_ES" "en_US")))
    (ispell-change-dictionary change)
    (message "Dictionary switched from %s to %s" dic change)
    ))

  (global-set-key (kbd "<f8>")   'lem/switch-dictionary)
#+end_src

**** Install language tool

Language tool is a software that check both, grammar and spelling in different
languages.

***** Install the binary

#+begin_src shell
curl https://languagetool.org/download/LanguageTool-stable.zip -o /tmp/LanguageTool-stable.zip
mkdir -p ~/.local/lib/
unzip /tmp/LanguageTool-stable.zip -d ~/.local/lib/languageTool
#+end_src

#+begin_src emacs-lisp
  (use-package langtool
     :config
     (setq langtool-language-tool-jar "~/.local/lib/languageTool/LanguageTool-6.3/languagetool-commandline.jar"
  langtool-default-language "en-US"))
#+end_src

*** Visual fill configuration

#+begin_src emacs-lisp
  ;; Wrap the text in a custom column size
  (defun lem/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          fill-column 80
          visual-fill-column-center-text t))

  (use-package visual-fill-column
    :defer t
    :hook (text-mode . lem/org-mode-visual-fill))
#+end_src

*** Sync my files
I have a script which try to keep sync with a repository on codeberg. This repo
contains the org files only, and it is named sync.

#+begin_src emacs-lisp
  (defun lem/sync (path)
    (shell-command-to-string (format "/home/lucas/.local/bin/sync.sh %s" path)))

  (defun lem/sync-org ()
  "Sync the Org foler with an external script"
  (interactive)
  (lem/sync "~/Documents/Org"))

  (defun lem/sync-conf ()
  "Sync the config foler with an external script"
(interactive)
(lem/sync "~/Documents/git/dotfiles"))

  ;; (add-hook 'after-save-hook 'lem/sync) Use as hook generate a lot of commits
#+end_src
** Text mode
Aditionaly to the last hook I will make more adjustement into the text view

#+begin_src emacs-lisp
  (defun lem/text-mode-setup ()
    (variable-pitch-mode 1)
    (auto-fill-mode 1)
    (visual-fill-column-mode 1)
    (setq evil-auto-indent nil))

  (add-hook 'text-mode-hook 'lem/text-mode-setup)
#+end_src

** Org mode

#+begin_src emacs-lisp
  (defun lem/org-mode-hook ()
    (org-indent-mode)
      (diminish org-indent-mode))

  (use-package org
  :hook (org-mode . lem/org-mode-hook)
  :config
  (setq org-directory "~/Documents/Org/"
        org-default-notes-file (concat org-directory "Inbox.org")
        org-ellipsis " ▾"
        org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
        org-superstar-item-bullet-alist '((?- . ?➤) (?+ . ?✦)) ; changes +/- symbols in item lists
        org-log-done 'time
        org-hide-emphasis-markers nil
        org-table-convert-region-max-lines 20000
        org-src-fontify-natively t
        org-fontify-quote-and-verse-blocks t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 2
        org-hide-block-startup nil
        org-src-preserve-indentation nil
        org-cycle-separator-lines 2
        org-refile-targets '((nil :maxlevel . 2)
                            (org-agenda-files :maxlevel . 1))
        org-outline-path-complete-in-steps nil
        org-refile-use-outline-path t)

#+end_src

The org mode is not close

*** GTD
**** Multiple  keyword sets in one file
From the [[https://orgmode.org/manual/Multiple-sets-in-one-file.html][org manual]], sometimes you want to use different sets of TODO keywords in parallel. For
example a set for task that could be =DONE= or =TODO=, other task that could depends on other and
include the keyword =WAITING= and so on.

IMPORTANT* You can only use set at time, so you need first to select the correct workflow. The
shortcut to select them is: =C-u C-u C-c C-t=;  =C-s-RIGHT=;  =C-s-LEFT=

****  Workflow states
- *TODO*: A task which should be done, but is not processed
- *NEXT*: With the GTD flow, the next task to be done
- *WAIT*: This task depends on other person, so it's not actionable
- *DONE*: Need explication?

#+begin_src emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "WAIT(w)" "|" "DONE(d!)" "CANCELED(c!)")))
#+end_src

**** Tags

Tags helps to filter over all task. This task are mutually exclusive, allowing to determinate its context.
- *batch* Low effort
- *followup* Someone is waiting on me to finish this task
#+begin_src emacs-lisp
  (setq org-tag-alist
      '((:startgroup . nil)
       ;Put mutually exclusive tags here
       ("@home" . ?H )
       ("@PHD" . ?P)
       ("@UI" . ?U)
       (:endgroup . nil)))
#+end_src

**** Priorities

#+begin_src emacs-lisp
  (setq org-fancy-priorities-list '("🟥" "🟧" "🟨")
        org-priority-faces
        '((?A :foreground "#ff6c6b" :weight bold)
          (?B :foreground "#98be65" :weight bold)
          (?C :foreground "#c678dd" :weight bold))
        org-agenda-block-separator 8411)
#+end_src

**** Agendas
Configure the agenda views

#+begin_src emacs-lisp
  (setq org-agenda-files
        (mapcar (lambda (file) (concat org-directory file)) '("Tasks.org" "Habits.org"))
        org-agenda-window-setup 'current-window
        org-agenda-span 'week
        org-agenda-start-with-log-mode t
        org-log-into-drawer t
        org-columns-default-format "%20CATEGORY(Category) %30ITEM(Task) %4TODO %6Effort(Estim){:} %20SCHEDULED %20DEADLINE %6CLOCKSUM(Clock) %TAGS")
#+end_src

Org agenda is a mode of emacs that allows you to view the task for the week

Note 1* You can shcedule the todos with org-shedule command or due time with
org-deadline. To move around the date use ~Shift+arrows~


Note 2*: We can get a repeat item ading to the deadline the period of time to
be repeat, for example a birthday that is repeat each year (see the agenda file)

**** Control time per task

Emacs give you a way to capture the time you spends on each task. You only need
go over the task and execute the command =org-clock-in= and when you stop or
finish go again over the task and run =org-clock-out=

#+begin_src emacs-lisp
  (setq org-clock-persist 'history)
  (org-clock-persistence-insinuate)
#+end_src

**** Capture template for task
The following templates should be used to customize the behavior of the capture
process for new tasks.

#+begin_src emacs-lisp
  (setq org-capture-templates
        `(("t" "Tasks")
          ("tt" "Task" entry (file+olp+datetree ,(concat org-directory "Tasks.org"))
           "* TODO %?\n  %i" :empty-lines 1)
          ("tm" "Meeting" entry (file+headline ,(concat org-directory "Tasks.org") "Meeting")
           "* %? :meeting:\n<%<%Y-%m-%d %a %H:00>>")
        ("tn" "Note" entry (file ,(concat org-directory "notes.org"))
         "* Note (%a)\nEntered on %U\n%?")))
#+end_src

**** Pomodoro
#+begin_src emacs-lisp
(use-package org-pomodoro
    :ensure t
    :after org
    :config
    (setq
     alert-user-configuration (quote ((((:category . "org-pomodoro")) libnotify nil)))
     org-pomodoro-length 90
     org-pomodoro-short-break-length 10
     org-pomodoro-long-break-length 20
     org-pomodoro-clock-break t
     org-pomodoro-manual-break t))

  (defun set-pomodoro-timer (minutes)
    (interactive "nMinutes: ")
    (setq org-pomodoro-length minutes))

#+end_src

**** Habit

#+begin_src emacs-lisp
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60
        org-habit-show-all-today nil
        org-habit-show-habits-only-for-today nil)
#+end_src
*** Configure Babel languages

To execute or export code in org-mode code blocks, you’ll need to set up org-babel-load-languages
for each language you’d like to use. [[https:orgmode.org/worg/org-contrib/babel/languages/index.html][This page]] documents all of the languages that you can use with
org-babel.

#+begin_src emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (js . t)
   (shell . t)
   (gnuplot . t)))

(push '("conf-unix" . conf-unix) org-src-lang-modes)
(org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
#+end_src

**** Structure templates
Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files
in combination with =org-tempo= by typing =<= followed by the template name like =el= or =py= and
then press =TAB=.  For example, to insert an empty =emacs-lisp= block below, you can type =<el= and
press =TAB= to expand into such a block.

You can add more =src= block templates below by copying one of the lines and
changing the two strings at the end, the first to be the template name and the
second to contain the name of the language [[https://orgmode.org/worg/org-contrib/babel/languages.html][as it is known by Org Babel]].
#+begin_src emacs-lisp
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("js" . "src python"))
  (add-to-list 'org-structure-template-alist '("ex" . "export"))
#+end_src

*** Fonts and bullets
**** Bullets
Use bullet characters instead of asterisks, plus set the header font sizes to something more palatable. A fair amount of inspiration has been taken from [[https://zzamboni.org/post/beautifying-org-mode-in-emacs/][this blog post]].
#+begin_src emacs-lisp
  (use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode))
#+end_src

**** Increase the size of various heading
I dont like how it is shown
#+begin_src emacs-lisp :tangle no
;;(set-face-attribute 'org-document-title nil :font default-variable-pitch-font :weight 'bold :height 1.3)
(dolist (face '((org-level-1 . 1.3)
                (org-level-2 . 1.25)
                (org-level-3 . 1.2)
                (org-level-4 . 1.15)
                (org-level-5 . 1.1)
                (org-level-6 . 1.05)
                (org-level-7 . 1)
                (org-level-8 . 1.0)))
  (set-face-attribute (car face) nil :font default-variable-pitch-font :weight 'medium :height (cdr face)))
#+end_src

