.emacs.d/config.el

(defun lem/switch-dictionary()
(interactive)
(let* ((dic ispell-current-dictionary)
   (change (if (string= dic "en_US") "es_ES" "en_US")))
  (ispell-change-dictionary change)
  (message "Dictionary switched from %s to %s" dic change)
  ))

(global-set-key (kbd "<f8>")   'lem/switch-dictionary)

(use-package langtool
   :config
   (setq langtool-language-tool-jar "~/.local/lib/languageTool/LanguageTool-6.3/languagetool-commandline.jar"
langtool-default-language "en-US"))

;; Wrap the text in a custom column size
(defun lem/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        fill-column 80
        visual-fill-column-center-text t))

(use-package visual-fill-column
  :defer t
  :hook (text-mode . lem/org-mode-visual-fill))

(defun lem/sync (path)
    (shell-command-to-string (format "/home/lucas/.local/bin/sync.sh %s" path)))

  (defun lem/sync-org ()
  "Sync the Org foler with an external script"
  (interactive)
  (lem/sync "~/Documents/Org"))

  (defun lem/sync-conf ()
  "Sync the config foler with an external script"
(interactive)
(lem/sync "~/Documents/git/dotfiles"))

  ;; (add-hook 'after-save-hook 'lem/sync) Use as hook generate a lot of commits

(defun lem/text-mode-setup ()
  (variable-pitch-mode 1)
  (auto-fill-mode 1)
  (visual-fill-column-mode 1)
  (setq evil-auto-indent nil))

(add-hook 'text-mode-hook 'lem/text-mode-setup)

(defun lem/org-mode-hook ()
  (org-indent-mode)
    (diminish org-indent-mode))

(use-package org
:hook (org-mode . lem/org-mode-hook)
:config
(setq org-directory "~/Documents/Org/"
      org-default-notes-file (concat org-directory "Inbox.org")
      org-ellipsis " ▾"
      org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
      org-superstar-item-bullet-alist '((?- . ?➤) (?+ . ?✦)) ; changes +/- symbols in item lists
      org-log-done 'time
      org-hide-emphasis-markers nil
      org-table-convert-region-max-lines 20000
      org-src-fontify-natively t
      org-fontify-quote-and-verse-blocks t
      org-src-tab-acts-natively t
      org-edit-src-content-indentation 2
      org-hide-block-startup nil
      org-src-preserve-indentation nil
      org-cycle-separator-lines 2
      org-refile-targets '((nil :maxlevel . 2)
                          (org-agenda-files :maxlevel . 1))
      org-outline-path-complete-in-steps nil
      org-refile-use-outline-path t)

(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "WAIT(w)" "|" "DONE(d!)" "CANCELED(c!)")))

(setq org-tag-alist
    '((:startgroup . nil)
     ;Put mutually exclusive tags here
     ("@home" . ?H )
     ("@PHD" . ?P)
     ("@UI" . ?U)
     (:endgroup . nil)))

(setq org-fancy-priorities-list '("🟥" "🟧" "🟨")
      org-priority-faces
      '((?A :foreground "#ff6c6b" :weight bold)
        (?B :foreground "#98be65" :weight bold)
        (?C :foreground "#c678dd" :weight bold))
      org-agenda-block-separator 8411)

(setq org-agenda-files
      (mapcar (lambda (file) (concat org-directory file)) '("Tasks.org" "Habits.org"))
      org-agenda-window-setup 'current-window
      org-agenda-span 'week
      org-agenda-start-with-log-mode t
      org-log-into-drawer t
      org-columns-default-format "%20CATEGORY(Category) %30ITEM(Task) %4TODO %6Effort(Estim){:} %16SCHEDULED %6CLOCKSUM(Clock) %TAGS")

(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)

(setq org-capture-templates
      `(("t" "Tasks")
        ("tt" "Task" entry (file+olp+datetree ,(concat org-directory "Tasks.org"))
         "* TODO %?\n  %i"
         :empty-lines 1)))

(use-package org-pomodoro
    :ensure t
    :after org
    :config
    (setq
     alert-user-configuration (quote ((((:category . "org-pomodoro")) libnotify nil)))
     org-pomodoro-length 90
     org-pomodoro-short-break-length 10
     org-pomodoro-long-break-length 20
     org-pomodoro-clock-break t
     org-pomodoro-manual-break t))

  (defun set-pomodoro-timer (minutes)
    (interactive "nMinutes: ")
    (setq org-pomodoro-length minutes))

(require 'org-habit)
(add-to-list 'org-modules 'org-habit)
(setq org-habit-graph-column 60
      org-habit-show-all-today nil
      org-habit-show-habits-only-for-today nil)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (js . t)
   (shell . t)
   (gnuplot . t)))

(push '("conf-unix" . conf-unix) org-src-lang-modes)
(org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)

;; This is needed as of Org 9.2
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("js" . "src python"))
(add-to-list 'org-structure-template-alist '("ex" . "export"))

(use-package org-superstar
:after org
:hook (org-mode . org-superstar-mode))
