.emacs.d/config.org
**** Setting monospace fonts for required text
#+begin_src emacs-lisp
(require 'org-indent)
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-date nil :inherit 'fixed-pitch)
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
#+end_src

*** Adding some key binding

#+begin_src emacs-lisp
  ;; function to search into the org folder
  (defun lem/org-search ()
    (interactive)
    (counsel-rg "" org-directory nil "Search notes: "))

;;  (use-package evil-org
;;    :after org
;;    :hook ((org-mode . evil-org-mode)
;;           (org-agenda-mode . evil-org-mode)
;;           (evil-org-mode . (lambda () (evil-org-set-key-theme '(navigation todo insert textobjects additional)))))
;;    :config
;;    (require 'evil-org-agenda)
;;    (evil-org-agenda-set-keys))
;;
  (lem/leader-key-def
    "o" '(:ignore t :which-key "org mode")
    "oi" '(:ignore t :which-key "Insert")
    "oil" '(org-insert-link :which-key "insert link")
    "on"  '(org-toggle-narrow-to-subtree :which-key "toggle narrow")
    "os"  '(lem/org-search :which-key "search notes")
    "oa" '(org-agenda :which-key "Status")
    ;;"ot" '(org-todo-list :which-key "Show TODOs")
    "oc" '(org-capture t :which-key "Capture")
    "op" '(:ignore t :which-key "Pomodoro")
    "ops" '(org-pomodoro :whick-key "Start org pomodoro")
    "opt" '(set-pomodoro-timer :which-key "Set pomodoro timer")) 
#+end_src

*** Close org mode configuration
#+begin_src emacs-lisp
  )
#+end_src

*** Org templates
In this subsection, I will add some capture to the capture list, that are not   
related with any workflow 
#+begin_src emacs-lisp
  (add-to-list 'org-capture-templates
  `("m" "Fondos" table-line                                        
                   (file+headline ,(expand-file-name "Metrics.org" org-directory) "Fondos")
                   "| %U | %^{fondo1} | %^{fondo2} |" :kill-buffer t) t)
#+end_src

*** Org toc
#+begin_src emacs-lisp
  (use-package toc-org                                                          
    :hook (org-mode . toc-org-mode))
#+end_src

*** Org-auto-tangle
Org  auto-tangle enable tangle the content of a document each time, you save the
org file. You need to add the option ~#+auto_tangle: t~ in the header of the file
#+begin_src emacs-lisp

    (use-package org-auto-tangle
      :defer t
      :hook (org-mode . org-auto-tangle-mode)
      :config
      (setq org-auto-tangle-default nil))

    (defun lem/insert-auto-tangle-tag ()
      "Insert auto-tangle tag in literature config."
      (interactive)
      (evil-org-open-below 1)
      (insert "#+auto_tangle: t ")
      (evil-force-normal-state))

  (lem/leader-key-def
    "ia" '(lem/insert-auto-tangle-tag :which-key "Insert auto-tangle header tag"))

#+end_src
** Org roam mode
Org-roam is a tool for networked thought. It reproduces some of the Roam
Research’s key features within Org-mode.

*** Installation
The instalation process use the melpa or melpa stable package manager from emacs.

#+begin_src emacs-lisp
    (use-package org-roam
      :custom
      (org-roam-directory (expand-file-name "roam" org-directory))
      (org-roam-completion-everywhere t)
      (org-roam-dailies-capture-templates
       '(("d" "default" entry "* %<%I:%M %p>: %?"
          :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n\n* Time Managment\n#+BEGIN: clocktable :scope agenda :maxlevel 6 :block %<%Y-%m-%d>\n#+CAPTION: \n#+END:" ("Notes")))))
      :bind (("C-c n l" . org-roam-buffer-togle)
             ("C-c n f" . org-roam-node-find)
             ("C-c n i" . org-roam-node-insert)
             ("C-c n I" . org-roam-node-insert-immediate)
             :map org-mode-map
             ("C-M-i" . completion-at-point)
             :map org-roam-dailies-map
             ("Y" . org-roam-dailies-capture-yesterday)
             ("T" . org-roam-dailies-capture-tomorrow))
      :bind-keymap
      ("C-c n d" . org-roam-dailies-map)
      :config
      (require 'org-roam-dailies) ;; Ensure the keymap is available
      ;;Autosync mode allows to keep track and cache all changes to maintain cache consistency. Also this configuration parameter was moved to the package declaration
      (org-roam-db-autosync-mode)
      ;; refresh agenda list after load org-roam
      (my/org-roam-refresh-agenda-list)
#+end_src

Also the org roam is not close
*** Configure org roam templates
#+begin_src emacs-lisp
(setq org-roam-capture-templates
 '(("f" "Fleeting" plain "%?"
     :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n#+DATE: %U\n#+AUTHOR: %n\n#+filetags: fleeting")
     :unnarrowed nil)
   ("d" "default" plain "%?"
    :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n#+author: %n\n")
    :unnarrowed t)
   ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
    :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+category: ${title}\n#+filetags: Project")
    :unnarrowed t)))
#+end_src
*** Configure org roam completion

If you’re using a vertical completion framework, such as Ivy, Org-roam supports
the generation of an aligned, tabular completion interface. For example, to
include a column for tags, one can set org-roam-node-display-template as such:

#+begin_src emacs-lisp
(setq org-roam-node-display-template
      (concat "${title:*} "
              (propertize "${tags:*}" 'face 'org-tag)))
#+end_src

*** End of org roam
#+begin_src emacs-lisp
)
#+end_src

*** Some functions used for customize org-roam
#+begin_src emacs-lisp
  (defun my/org-roam-filter-by-tag (tag-name)
    (lambda (node)
      (member tag-name (org-roam-node-tags node))))

  (defun my/org-roam-list-notes-by-tag (tag-name)
    (mapcar #'org-roam-node-file
            (seq-filter
             (my/org-roam-filter-by-tag tag-name)
             (org-roam-node-list))))
  (defun my/org-roam-refresh-agenda-list ()
    (interactive)
    (setq org-agenda-files (delete-dups (append org-agenda-files (my/org-roam-list-notes-by-tag "Project")))))

  (defun my/org-roam-find-project ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)

    ;; Select a project file to open, creating it if necessary
    (org-roam-node-find
     nil
     nil
     (lambda (node)
       (member "Project" (org-roam-node-tags node)))))

  (defun my/org-roam-capture-task ()
  (interactive)
  (org-roam-capture- :node (org-roam-node-read
                                nil
                                (my/org-roam-filter-by-tag "Project"))
                       :templates '(
                                    ("p" "project" plain "** TODO %?"
                                     :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                                            "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                                            ("Tasks")))
                                    ("s" "start now" entry "** TODO %?"
                                     :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                                            "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                                            ("Tasks"))
                                     :clock-in :clock-resume)
                                    ("m" "Meeting")
                                    ("mp" "Prepare meeting" entry "** Notes\n %?"
                                     :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                                            "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                                            ("Meetings"))
                                     :target (file+olp+datetree "%<%Y%m%d%H%M%S>-${slug}.org" ("Meetings"))))))
#+end_src

