.emacs.d/config.org
*** Keybinding for org-roam
#+begin_src emacs-lisp
  (lem/leader-key-def
    "or"  '(:ignore t :which-key "Org roam")
    "orl" '(org-roam-buffer-togle :which-key "Org roam buffer togle")
    "orf" '(org-roam-node-find :whick-key "Org roam node find")
    "ori" '(org-roam-node-insert :whick-key "Org roam node insert")
    "orI" '(org-roam-node-insert-immediate :which-key "Org roam insert immediately")
    "orc" 'my/org-roam-capture-task)
#+end_src
*** Zettelkasten
The zettelkasten methodology offers a set of rules to help you to organize your
notes in a way that makes them easy to find. It is based on the idea of
establishing links between atomic concepts (each note). On this way, breaks the
traditional hierarchical structure based on folders and makes it easier to
relate concepts

There are 4 kind of notes:

**** 1. Fleeting notes
Fleeting notes are thinkings, ideas, concepts and sketch of future notes. They
need to be processed and related with another notes. To make it simple, the name
of this notes has a prefix with the current date and time, so can be many notes
with the same “title”. This method make easy not be distracted by the title
instead of the concept.

#+begin_src emacs-lisp :tangle no
  ; I move the definition of this template to the org-roam package declaration
  ; because when it run, the org-roam package is not full load
  (add-to-list 'org-roam-capture-templates
               '("f" "Fleeting" plain "%?"
                 :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n#+DATE: %U\n#+AUTHOR: %n\n#+filetags: fleeting")
                 :unnarrowed nil))
#+end_src

**** 2. Literature Notes
Literature notes are notes extracted from external source. These must include                                                                                                                                      
the reference. These notes have summary or/and highlight from the source, and if
it is possible, tray to indicate:                                               
                                                                                
1. Why this content is relevant?                                                
2. When you read the source?                                                    
3. In which content do you think it can be useful?                              
                                                                                
To answer this question, you can use meta-data as header from of the note, a    
link to the project/area which you think that can be useful and a link to       
another note with the explanation. This allows you to keep separate the original
content to your conclusion and ideas.

#+begin_src emacs-lisp
(setq bibliography-files '("~/Documents/Org/bibliography.bib"
                             "~/Documents/Org/phd.bib"))
(use-package ivy-bibtex
  :config
  (setq bibtex-completion-bibliography bibliography-files))

  (use-package org-ref                                                                                                                                                                                             
    :init (require 'bibtex)                                                     
    :config (setq bibtex-autokey-year-length 4                                  
                  bibtex-autokey-name-year-separator "-"                        
                  bibtex-autokey-year-title-separator "-"                       
                  bibtex-autokey-titleword-separator "-"                        
                  bibtex-autokey-titlewords 2                                   
                  bibtex-autokey-titlewords-stretch 1                           
                  bibtex-autokey-titleword-length 5                             
                  org-ref-glsentries '("~/Documents/Org/roam/glossary.tex"))    
    (define-key bibtex-mode-map (kbd "H-b") 'org-ref-bibtex-hydra/body)         
    (define-key org-mode-map (kbd "C-c ]") 'org-ref-insert-link)                
    (define-key org-mode-map (kbd "s-[") 'org-ref-insert-link-hydra/body)       
    (require 'org-ref-ivy)                                                      
    (require 'org-ref-sci-id)                                                   
    (require 'org-ref-arxiv)                                                    
    (require 'org-ref-scopus)                                                   
    (require 'org-ref-pubmed)                                                   
    (require 'org-ref-wos)                                                      
    (setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body    
                org-ref-insert-cite-function 'org-ref-cite-insert-ivy           
                org-ref-insert-label-function 'org-ref-insert-label-link        
                org-ref-insert-ref-function 'org-ref-insert-ref-link            
                org-ref-cite-onclick-function (lambda (_)                       
                  (org-ref-citation-hydra/body))))
#+end_src
***** Citar                                                                       
                                                                                
[[https://github.com/emacs-citar/citar][Citar]] provides a highly-configurable completing-read front-end to browse and act
on BibTeX, BibLaTeX, and CSL JSON bibliographic data, and LaTeX, markdown, and  
org-cite editing support.                                                       
                                                                                
#+begin_src emacs-lisp
  (use-package citar                                                            
    :custom                                                                     
    (citar-bibliography bibliography-files))                                    
#+end_src                                                                       

****** citar-org-roam                                                              
                                                                                
This package use citar as base to improve the citation process.                 
                                                                                
#+begin_src emacs-lisp
  (use-package org-roam-bibtex :after org-roam)                                 
  (use-package citar-org-roam                                                   
    :after (citar org-roam)                                                      
    :config                                                                      
    (citar-org-roam-mode)                                                        
    (citar-register-notes-source 'orb-citar-source                               
                                 (list :name "Org-Roam Notes"                                                
                                       :category 'org-roam-node                                                   
                                       :items #'citar-org-roam--get-candidates                                    
                                       :hasitems #'citar-org-roam-has-notes                                       
                                       :open #'citar-org-roam-open-note                                           
                                       :create #'orb-citar-edit-note                                              
                                       :annotate #'citar-org-roam--annotate))                                     
    (setq citar-notes-source 'orb-citar-source)                                 

  (setq citar-org-roam-note-title-template "${author} - ${title}")              
  (add-to-list 'org-roam-capture-templates                                      
               '("r" "bibliography reference" plain "%?"                        
                 :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"                                                                                                                                                  
                                    "#+TITLE: ${title}\n#+AUTHOR: ${author}\n#+filetags: Literature\n#+cite-key: ${citekey}\n#+cite-date: ${date} \n#+created: %U\n\n* ${title}\n\n")
                 :unnarrowed t) t)                                              
  (setq citar-org-roam-capture-template-key "r"))                                
#+end_src   

