.emacs.d/config.el
  "or"  '(:ignore t :which-key "Org roam")
  "orl" '(org-roam-buffer-togle :which-key "Org roam buffer togle")
  "orf" '(org-roam-node-find :whick-key "Org roam node find")
  "ori" '(org-roam-node-insert :whick-key "Org roam node insert")
  "orI" '(org-roam-node-insert-immediate :which-key "Org roam insert immediately")
  "orc" 'my/org-roam-capture-task)

(setq bibliography-files '("~/Documents/Org/bibliography.bib"
                             "~/Documents/Org/phd.bib"))
(use-package ivy-bibtex
  :config
  (setq bibtex-completion-bibliography bibliography-files))

  (use-package org-ref                                                                                                                                                                                             
    :init (require 'bibtex)                                                     
    :config (setq bibtex-autokey-year-length 4                                  
                  bibtex-autokey-name-year-separator "-"                        
                  bibtex-autokey-year-title-separator "-"                       
                  bibtex-autokey-titleword-separator "-"                        
                  bibtex-autokey-titlewords 2                                   
                  bibtex-autokey-titlewords-stretch 1                           
                  bibtex-autokey-titleword-length 5                             
                  org-ref-glsentries '("~/Documents/Org/roam/glossary.tex"))    
    (define-key bibtex-mode-map (kbd "H-b") 'org-ref-bibtex-hydra/body)         
    (define-key org-mode-map (kbd "C-c ]") 'org-ref-insert-link)                
    (define-key org-mode-map (kbd "s-[") 'org-ref-insert-link-hydra/body)       
    (require 'org-ref-ivy)                                                      
    (require 'org-ref-sci-id)                                                   
    (require 'org-ref-arxiv)                                                    
    (require 'org-ref-scopus)                                                   
    (require 'org-ref-pubmed)                                                   
    (require 'org-ref-wos)                                                      
    (setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body    
                org-ref-insert-cite-function 'org-ref-cite-insert-ivy           
                org-ref-insert-label-function 'org-ref-insert-label-link        
                org-ref-insert-ref-function 'org-ref-insert-ref-link            
                org-ref-cite-onclick-function (lambda (_)                       
                  (org-ref-citation-hydra/body))))

(use-package citar                                                            
  :custom                                                                     
  (citar-bibliography bibliography-files))

(use-package org-roam-bibtex :after org-roam)                                 
(use-package citar-org-roam                                                   
  :after (citar org-roam)                                                      
  :config                                                                      
  (citar-org-roam-mode)                                                        
  (citar-register-notes-source 'orb-citar-source                               
                               (list :name "Org-Roam Notes"                                                
                                     :category 'org-roam-node                                                   
                                     :items #'citar-org-roam--get-candidates                                    
                                     :hasitems #'citar-org-roam-has-notes                                       
                                     :open #'citar-org-roam-open-note                                           
                                     :create #'orb-citar-edit-note                                              
                                     :annotate #'citar-org-roam--annotate))                                     
  (setq citar-notes-source 'orb-citar-source)                                 

(setq citar-org-roam-note-title-template "${author} - ${title}")              
(add-to-list 'org-roam-capture-templates                                      
             '("r" "bibliography reference" plain "%?"                        
               :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"                                                                                                                                                  
                                  "#+TITLE: ${title}\n#+AUTHOR: ${author}\n#+filetags: Literature\n#+cite-key: ${citekey}\n#+cite-date: ${date} \n#+created: %U\n\n* ${title}\n\n")
               :unnarrowed t) t)                                              
(setq citar-org-roam-capture-template-key "r"))
