.emacs.d/config.org
***** Import annotations from Zotero                                              
                                                                                
#+begin_src emacs-lisp
  (defun lem/import-notes-from-zotero (citekey)                                 
  (interactive "sCiteKey: ")                                                    
    (let* ((entry (bibtex-completion-get-entry citekey))                        
           (note (bibtex-completion-get-value "note" entry ""))                 
           (pandoc-command "pandoc --from latex --to org")                      
           result)                                                              
      (with-temp-buffer                                                         
        (shell-command (format "echo \"%s\" | %s" note pandoc-command)          
                       (current-buffer))                                        
        (setq result (buffer-substring-no-properties (point-min) (point-max)))) 
      (insert result)))                                                         
#+end_src                                                                       
                                                                                
I need if I add a new acronym, this will not be added only on the top of the    
current buffer, such happens with org-ref. I need the acronym or the glossary   
entry will be added into the list with all the acronyms.                        
                                                                                
#+begin_src emacs-lisp                                                          
  (defun lem/add-acronym (label abbrv full)                                     
    (interactive "sLabel: \nsAccronym: \nsFull text: ")                         
    (save-excursion                                                             
      (re-search-backward "#\\+latex_header" nil t)                             
      (forward-line)                                                            
      (when (not (looking-at "^$"))                                             
        (beginning-of-line)                                                     
        (insert "\n")                                                           
        (forward-line -1))                                                      
      (insert (format "#+latex_header_extra: \\newacronym{%s}{%s}{%s}\n"        
                      label abbrv full))                                        
      (write-region                                                             
       (format                                                                  
        "\\newacronym{%s}{%s}{%s}\n"                                            
        label abbrv full)                                                       
       nil "~/Documents/Org/roam/glossary.tex" 'append)))                       
                                                                                
#+end_src

**** 3. Permanent Notes
Permanent notes are stand-alone ideas, that can be made without any direct      
context to other sourced. Can be made as a recap or summary of the information, 
but also can be thoughts that popped into your brain while you are working.     
                                                                                
The aim of permanent notes is to process the notes you have made and extract    
ideas, related content and any kind of useful information for you. 

**** 4. Index Notes
Index notes are these notes used to group connected notes. Can be a TOC, a sort 
description, or whatever you want.

*** Org-roam-ui

#+begin_src emacs-lisp
(use-package org-roam-ui)
#+end_src

** PDFs
[[https://github.com/vedang/pdf-tools][pdf-tools]] is a replacement of DocView for viewing PDF files inside Emacs.  It
uses the ~poppler~ library, which also means that =pdf-tools= can by used to
modify PDFs.  I use to disable ‘display-line-numbers-mode’ in ‘pdf-view-mode’
because line numbers crash it.

#+begin_src emacs-lisp
(use-package pdf-tools
  :defer t
  :commands (pdf-loader-install)
  :mode "\\.pdf\\'"
  :bind (:map pdf-view-mode-map
              ("j" . pdf-view-next-line-or-next-page)
              ("k" . pdf-view-previous-line-or-previous-page)
              ("C-=" . pdf-view-enlarge)
              ("C--" . pdf-view-shrink))
  :init (pdf-loader-install)
  :config (add-to-list 'revert-without-query ".pdf"))

;;(add-hook 'pdf-view-mode-hook #'dt/turn-off-line-numbers)
(add-hook 'pdf-view-mode-hook #'(lambda () (interactive) (display-line-numbers-mode -1)))
#+end_src
* Dashboard
Emacs Dashboard is an extensible startup screen showing you recent files,
bookmarks, agenda items and an Emacs banner.

#+begin_src emacs-lisp
  (use-package dashboard
      :ensure t
      :init      ;; tweak dashboard config before loading it
      (setq dashboard-set-heading-icons t)
      (setq dashboard-set-file-icons t)
      (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
      ;;(setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
      ;;(setq dashboard-startup-banner "~/.emacs.d/emacs-dash.png")  ;; use custom image as banner
      (setq dashboard-center-content nil) ;; set to 't' for centered content
      (setq dashboard-icon-type 'all-the-icons)
      (setq dashboard-items '((recents . 5)
                  (agenda . 5 )
                  (bookmarks . 3)
                  (projects . 5)
                  (registers . 3)))
      :config
      (dashboard-setup-startup-hook)
      (dashboard-modify-heading-icons '((recents . "file-text")
                        (bookmarks . "book"))))
    ; ensure emacs open in dashboard
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+end_src

* Terminal emulator

** vterm
vterm enables the use of fully-fledged terminal applications within Emacs so
that I don't need an external terminal emulator.

It need to be compiled, so you need to install first some dependencies
#+begin_src shell
  apt install make cmake libterm-bin libterm
#+end_src

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :config
    (setq vterm-max-scrollback 10000))

  (add-to-list 'display-buffer-alist
               '("\*vterm\*"
                 (display-buffer-in-side-window)
                 (window-height . 0.25)
                 (side . bottom)
                 (slot . 0)))
  ;;Still does not work
  (add-hook 'vterm-mode-hook 'evil-emacs-state)
  (add-hook 'term-mode-hook 'evil-emacs-state)

#+end_src

* Development

** Projectile

#+begin_src emacs-lisp
    (use-package projectile
      :diminish projectile-mode
      :demand t
      :bind-keymap
      ("C-c p" . projectile-command-map)
      :config (projectile-mode)
      (projectile-register-project-type 'npm '("package.json")
                                        :project-file "package.json"
                                        :compile "npm install"
                                        :test "npm test"
                                        :run "npm start"
                                        :test-suffix ".spec")
      :init
      (setq projectile-switch-project-action #'projectile-dired))

    (use-package counsel-projectile
      :after projectile
      :bind (("C-M-p" . counsel-projectile-find-file))
      :config
      (counsel-projectile-mode))

    (lem/leader-key-def
      "p"  '(:ignore t :which-key "Projectile")
      "pf" '(projectile-find-file :which-key "Projectile find file")
      "ps" '(projectile-switch-project :which-key "Projectile switch project")
      "pF" '(counsel-projectile-rg :which-key "Rip grep")
      "pc" '(projectile-compile-project :which-key "Compile Project")
      "pd" '(projectile-dired :which-key "Projectile dired")
      "pp" '(counsel-projetile :which-key "Counsel projectile"))
#+end_src

** Magit

#+begin_src emacs-lisp
  (use-package magit
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

*** Magit TODOs
This extension display all the comments with the word TODO inside the project

#+begin_src emacs-lisp
(use-package magit-todos :defer t)
#+end_src

*** Git gutter
Git gutter is a software which make easy to view the difference between a file and the last commit from the same file

#+begin_src emacs-lisp
    (use-package git-gutter
      :ensure t
      :diminish
      :hook ((prog-mode . git-gutter-mode)
             (text-mode . git-gutter-mode))
      :config
      (setq git-gutter:update-interval 0.2))

    (use-package git-gutter-fringe
      :ensure t
      :config
      (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
      (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
      (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))
#+end_src

*** Ediff

~ediff~ is a diff program that is built into Emacs.  By default, ‘ediff’ splits
files vertically and places the ‘help’ frame in its own window.  I have changed
this so the two files are split horizontally and the ~help~ frame appears as a
lower split within the existing window.  Also, I create my own ‘dt-ediff-hook’
where I add ~j/k~ for moving to next/prev diffs.  By default, this is set to
~n/p~.
#+begin_src emacs-lisp
(setq ediff-split-window-function 'split-window-horizontally
      ediff-window-setup-function 'ediff-setup-windows-plain)

(defun dt-ediff-hook ()
  (ediff-setup-keymap)
  (define-key ediff-mode-map "j" 'ediff-next-difference)
  (define-key ediff-mode-map "k" 'ediff-previous-difference))

(add-hook 'ediff-mode-hook 'dt-ediff-hook)
#+end_src
** Github copilot
Github copilot use OpenAI Codex to suggest code. There is not an emacs' version,
but there is an alternative based in the [[https://github.com/github/copilot.vim][official vim]] binaries
#+begin_src emacs-lisp
  (use-package copilot
    :straight (:host github :repo "zerolfx/copilot.el" :files ("dist" "*.el"))
    :ensure t)

(define-key copilot-completion-map (kbd "<tab>") 'copilot-accept-completion)
(define-key copilot-completion-map (kbd "TAB") 'copilot-accept-completion)
#+end_src

** Languages
