.emacs.d/config.el

(defun lem/import-notes-from-zotero (citekey)                                 
(interactive "sCiteKey: ")                                                    
  (let* ((entry (bibtex-completion-get-entry citekey))                        
         (note (bibtex-completion-get-value "note" entry ""))                 
         (pandoc-command "pandoc --from latex --to org")                      
         result)                                                              
    (with-temp-buffer                                                         
      (shell-command (format "echo \"%s\" | %s" note pandoc-command)          
                     (current-buffer))                                        
      (setq result (buffer-substring-no-properties (point-min) (point-max)))) 
    (insert result)))

(defun lem/add-acronym (label abbrv full)                                     
  (interactive "sLabel: \nsAccronym: \nsFull text: ")                         
  (save-excursion                                                             
    (re-search-backward "#\\+latex_header" nil t)                             
    (forward-line)                                                            
    (when (not (looking-at "^$"))                                             
      (beginning-of-line)                                                     
      (insert "\n")                                                           
      (forward-line -1))                                                      
    (insert (format "#+latex_header_extra: \\newacronym{%s}{%s}{%s}\n"        
                    label abbrv full))                                        
    (write-region                                                             
     (format                                                                  
      "\\newacronym{%s}{%s}{%s}\n"                                            
      label abbrv full)                                                       
     nil "~/Documents/Org/roam/glossary.tex" 'append)))

(use-package org-roam-ui)

(use-package dashboard
    :ensure t
    :init      ;; tweak dashboard config before loading it
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
    ;;(setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
    ;;(setq dashboard-startup-banner "~/.emacs.d/emacs-dash.png")  ;; use custom image as banner
    (setq dashboard-center-content nil) ;; set to 't' for centered content
    (setq dashboard-icon-type 'all-the-icons)
    (setq dashboard-items '((recents . 5)
                (agenda . 5 )
                (bookmarks . 3)
                (projects . 5)
                (registers . 3)))
    :config
    (dashboard-setup-startup-hook)
    (dashboard-modify-heading-icons '((recents . "file-text")
                      (bookmarks . "book"))))
  ; ensure emacs open in dashboard
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

(use-package vterm
    :commands vterm
    :config
    (setq vterm-max-scrollback 10000))

;;Still does not work
  (add-hook 'vterm-mode-hook 'evil-emacs-state)
  (add-hook 'term-mode-hook 'evil-emacs-state)

(use-package projectile
  :diminish projectile-mode
  :demand t
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :config (projectile-mode)
  (projectile-register-project-type 'npm '("package.json")
                                    :project-file "package.json"
                                    :compile "npm install"
                                    :test "npm test"
                                    :run "npm start"
                                    :test-suffix ".spec")
  :init
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :after projectile
  :bind (("C-M-p" . counsel-projectile-find-file))
  :config
  (counsel-projectile-mode))

(lem/leader-key-def
  "p"  '(:ignore t :which-key "Projectile")
  "pf" '(projectile-find-file :which-key "Projectile find file")
  "ps" '(projectile-switch-project :which-key "Projectile switch project")
  "pF" '(counsel-projectile-rg :which-key "Rip grep")
  "pc" '(projectile-compile-project :which-key "Compile Project")
  "pd" '(projectile-dired :which-key "Projectile dired")
  "pp" '(counsel-projetile :which-key "Counsel projectile"))

(use-package magit
  :commands (magit-status magit-get-current-branch)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package magit-todos :defer t)

(use-package git-gutter
  :ensure t
  :diminish
  :hook ((prog-mode . git-gutter-mode)
         (text-mode . git-gutter-mode))
  :config
  (setq git-gutter:update-interval 0.2))

(use-package git-gutter-fringe
  :ensure t
  :config
  (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))

(use-package copilot
    :straight (:host github :repo "zerolfx/copilot.el" :files ("dist" "*.el"))
    :ensure t)

(define-key copilot-completion-map (kbd "<tab>") 'copilot-accept-completion)
(define-key copilot-completion-map (kbd "TAB") 'copilot-accept-completion)
