.emacs.d/config.org
*** Language Server protocol

#+begin_src emacs-lisp
  (use-package lsp-mode
    :straight t
    :commands lsp
    :bind (:map lsp-mode-map
                ("TAB" . completion-at-point))
    :custom (lsp-headerline-breadcrumb-enable t))

  (lem/leader-key-def
    "l"  '(:ignore t :which-key "lsp")
    "ld" 'xref-find-definitions
    "lr" 'xref-find-references
    "ln" 'lsp-ui-find-next-reference
    "lp" 'lsp-ui-find-prev-reference
    "ls" 'counsel-imenu
    "le" 'lsp-ui-flycheck-list
    "lS" 'lsp-ui-sideline-mode
    "lX" 'lsp-execute-code-action)

  (use-package lsp-ui
    :straight t
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-sideline-enable t)
    (setq lsp-ui-sideline-show-hover nil)
    (setq lsp-ui-doc-position 'bottom)
    (lsp-ui-doc-show))
#+end_src

*** Debug Adapter Support

#+begin_src emacs-lisp :tangle no
(use-package dap-mode
  :straight t
  :custom
  (lsp-enable-dap-auto-configure nil)
  :config
  (dap-ui-mode 1)
  (dap-tooltip-mode 1)
  (require 'dap-node)
  (dap-node-setup))
#+end_src

*** TypeScript and JavaScript

Configure TypeScript and JavaScript language modes

#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :config
    (setq typescript-indent-level 4))

  (defun lem/set-js-indentation ()
    (setq js-indent-level 4)
    (setq evil-shift-width js-indent-level)
    (setq-default tab-width 4))

  (use-package js2-mode
    :mode "\\.jsx?\\'"
    :config
    ;; Use js2-mode for Node scripts
    (add-to-list 'magic-mode-alist '("#!/usr/bin/env node" . js2-mode))

    ;; Don't use built-in syntax checking
    (setq js2-mode-show-strict-warnings nil)

    ;; Set up proper indentation in JavaScript and JSON files
    (add-hook 'js2-mode-hook #'lem/set-js-indentation))

;;  (use-package apheleia
;;    :config
;;    (apheleia-global-mode +1))
;;
;;  (use-package prettier-js
;;    :config
;;    (setq prettier-js-show-errors nil))
#+end_src

*** HTML/CSS mode

Configure web mode
#+begin_src emacs-lisp
    (use-package web-mode
      :config
      (setq-default web-mode-code-indent-offset 2)
      (setq-default web-mode-markup-indent-offset 2)
      (setq-default web-mode-attribute-indent-offset 2))

    (use-package rainbow-delimiters :hook (prog-mode . rainbow-delimiters-mode))
    (use-package smartparens :hook (prog-mode . smartparens-mode))

  (defun lem/html-as-prog ()
    (interactive)
              (variable-pitch-mode 0)
              (auto-fill-mode 0)
              (visual-fill-column-mode 0))
(add-hook 'html-mode-hook 'lem/html-as-prog)

#+end_src

Rainbow mode allows to set the background of HTML color strings
#+begin_src emacs-lisp
(use-package rainbow-mode
  :defer t
  :hook (web-mode))
#+end_src

Combine httpd server with impatient mode

#+begin_src emacs-lisp
;; 1. Start the server with `httpd-start'
;; 2. Use `impatient-mode' on any buffer
(use-package impatient-mode :straight t)
#+end_src

*** Python

#+begin_src emacs-lisp
  (use-package python-mode
    :ensure t
    :hook (python-mode . lsp-deferred)
    :custom
    (python-shell-interpreter "python3"))
#+end_src

Install lsp

#+begin_src shell
pip install --user "python-language-server[all]"
#+end_src

In debian system:
#+begin_src shell
sudo apt install python3-pylsp python3-pytest pylint python3-pyflakes
#+end_src

For virtualenv

#+begin_src emacs-lisp
(use-package pyvenv
  :config
  (pyvenv-mode 1))
#+end_src

*** Compilation

Set up the compile package and ensure that compilation output automatically scrolls.

#+begin_src emacs-lisp
(use-package compile
  :straight nil
  :custom
  (compilation-scroll-output t))

(defun auto-recompile-buffer ()
  (interactive)
  (if (member #'recompile after-save-hook)
      (remove-hook 'after-save-hook #'recompile t)
    (add-hook 'after-save-hook #'recompile nil t)))
#+end_src

*** Productivity

**** Syntax checking with flycheck
#+begin_src emacs-lisp
(use-package flycheck
    :ensure t
    :defer t
    :diminish
    :init (global-flycheck-mode))
#+end_src

**** Smart parents
#+begin_src emacs-lisp :tangle no
(use-package smartparens
  :hook (prog-mode . smartparens-mode))
#+end_src

